import{c as e,r as o,m as s}from"./render-template.ccaa46bc.js";import{u as r}from"./hoisted.25135171.js";import"./astro-assets-services.5d54009f.js";const t=`<h2 id="母を殺された子ガニが協力者を得て猿をやっつける話">母を殺された子ガニが協力者を得て、猿をやっつける話</h2>
<p>お腹を空かせたカニのお母さんが食べ物を探していると、そこに柿を持った乱暴者の猿がやって来た。カニが物欲しそうに見ていると、猿は目の前で柿を食べ、その種をカニに投げつけた。</p>
<p>仕方なくカニは別の食べ物を探しているとおにぎりが落ちていた。猿もそれを見つけたが、カニが必死になってこれは自分の物だというと、猿は柿の種と取り替えないかと持ちかける。カニは断るが、猿は勝手におにぎりを食べて柿の種を置いていってしまう。</p>
<p>カニは悔しがったが、仕方がないので柿の種を植えて育てることにする。「早く芽を出せ柿の種。出さぬとハサミでちょんぎるぞ。」と歌うと地面から芽がでてきた。さらに歌うと柿の芽は木になり、さらに歌うと実がついた。</p>
<p>カニが柿の実を食べようとしたが、実に手が届かない。そこに意地悪な猿がまたやって来た。猿は「おいらが柿の実をとってきてやる」と言って勝手に木に登り、柿の実を次々と食べていき、カニにはまだ熟れていない青い柿をぶつける。</p>
<p>その拍子にカニの甲羅が割れて3匹のカニの子が産まれたが、その怪我がもとで、カニのお母さんは死んでしまった。やがて大きくなった3匹のカニの子は、母親の敵討ちをしようと決心し、栗と蜂と牛の糞と臼を仲間に入れて連携して猿を懲らしめることに成功した。</p>`,p={title:"テスト記事",publishDate:"2023 10 16",description:"This post is used for validating if duplicate tags are removed, regardless of the string case",tags:["blog","blog","Blog","test","bloG","Test","BLOG"],minutesRead:"3 min read"},a="/home/snd.webdev/prod/snd-techblog/src/content/post/テスト記事.md",i=void 0;function h(){return`
## 母を殺された子ガニが協力者を得て、猿をやっつける話

お腹を空かせたカニのお母さんが食べ物を探していると、そこに柿を持った乱暴者の猿がやって来た。カニが物欲しそうに見ていると、猿は目の前で柿を食べ、その種をカニに投げつけた。

仕方なくカニは別の食べ物を探しているとおにぎりが落ちていた。猿もそれを見つけたが、カニが必死になってこれは自分の物だというと、猿は柿の種と取り替えないかと持ちかける。カニは断るが、猿は勝手におにぎりを食べて柿の種を置いていってしまう。

カニは悔しがったが、仕方がないので柿の種を植えて育てることにする。「早く芽を出せ柿の種。出さぬとハサミでちょんぎるぞ。」と歌うと地面から芽がでてきた。さらに歌うと柿の芽は木になり、さらに歌うと実がついた。

カニが柿の実を食べようとしたが、実に手が届かない。そこに意地悪な猿がまたやって来た。猿は「おいらが柿の実をとってきてやる」と言って勝手に木に登り、柿の実を次々と食べていき、カニにはまだ熟れていない青い柿をぶつける。

その拍子にカニの甲羅が割れて3匹のカニの子が産まれたが、その怪我がもとで、カニのお母さんは死んでしまった。やがて大きくなった3匹のカニの子は、母親の敵討ちをしようと決心し、栗と蜂と牛の糞と臼を仲間に入れて連携して猿を懲らしめることに成功した。
`}function b(){return t}function C(){return[{depth:2,slug:"母を殺された子ガニが協力者を得て猿をやっつける話",text:"母を殺された子ガニが協力者を得て、猿をやっつける話"}]}const T=e((d,l,c)=>{const{layout:u,...n}=p;return n.file=a,n.url=i,o`${s()}${r(t)}`});export{T as Content,b as compiledContent,T as default,a as file,p as frontmatter,C as getHeadings,h as rawContent,i as url};
